In [85]:
import os 
import csv
import pandas as pd

In [86]:
pymoli_df = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(pymoli_df)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [87]:
player_count = len(purchase_data["SN"].unique())
player_count_s = pd.DataFrame({"Player Count": [player_count]})
player_count_s

   Player Count
0           576

In [88]:
total_items = purchase_data.groupby("Item Name")["Item Name"].nunique()
total_items.count()

179

In [89]:
average_price = purchase_data["Price"].mean()
average_price.round(2)

3.05

In [90]:
total_revenue = purchase_data["Price"].sum()
total_revenue.round(2)

2379.77

In [91]:
purchasing_analysis = pd.DataFrame({"Number of Unique Items":[total_items],
                                             "Average Price":[average_price],
                                            "Total Number of Purchases":[purchase_data],
                                             "Total Revenue":[total_revenue]})
purchasing_analysis

,Number of Unique Items,Average Price,Total Number of Purchases,Total Revenue
0,Item Name Abyssal Shard ...,3.050987,Purchase ID SN Age ...,2379.77

In [92]:
unique_items = len(purchase_data["Item Name"].unique())
average_purchase = purchase_data["Price"].mean()
number_purchases = len(purchase_data["Item Name"])
total_revenue = purchase_data["Price"].sum()

In [93]:
analysis_total = pd.DataFrame({"Number of Unique Items": [UniqueItems],
                                           "Average Price": [AvgPurchase],
                                           "Number of Purchases": [NumPurchase],
                                           "Total Revenue": [Revenue]})

In [94]:
# DataFrame formatting
analysis_total["Average Price"] = analysis_total["Average Price"].map("${:.2f}".format)
analysis_total["Total Revenue"] = analysis_total["Total Revenue"].map("${:.2f}".format)
analysis_total = analysis_total[["Number of Unique Items", "Average Price", "Number of Purchases", "Total Revenue"]]

analysis_total

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

In [95]:
gender_count = purchase_data.groupby("Gender")["SN"].nunique()
gender_count.head()

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [96]:
gender_percentage = gender_count/573
gender_percentage.round(2)

Gender
Female                   0.14
Male                     0.84
Other / Non-Disclosed    0.02
Name: SN, dtype: float64

In [97]:
gender_df = pd.DataFrame({"Gender Count": gender_count,"Gender Percentage":gender_percentage})
gender_df

                       Gender Count  Gender Percentage
Gender
Female                           81           0.141361
Male                            484           0.844677
Other / Non-Disclosed            11           0.019197

In [98]:
gender_purchases = purchase_data.groupby("Gender")["Item Name"]
gender_purchases.count()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Item Name, dtype: int64

In [99]:
gender_average = purchase_data.groupby("Gender")["Price"].mean()
gender_average.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [100]:
gender_total = purchase_data.groupby("Gender")["Price"].sum()
gender_total

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [101]:
average_total = gender_total/gender_count
average_total.round(2)

Gender
Female                   4.47
Male                     4.07
Other / Non-Disclosed    4.56
dtype: float64

In [102]:
gender_analysis_df = pd.DataFrame({"Purchase Count":gender_purchases, 
                                   "Average Purchase Price":gender_average,
                                   "Total Purchase Value":gender_total,
                                   "Avg Total Purchase Per person":average_total})
gender_analysis_df.round(2)

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase Per person
Gender,,,,
Female,"(Female, [Deadline, Voice Of Subtlety, Nirvana...",3.20,361.94,4.47
Male,"(Male, [Extraction, Quickblade Of Trembling Ha...",3.02,1967.64,4.07
Other / Non-Disclosed,"(Other / Non-Disclosed, [Ghastly Adamantite Pr...",3.35,50.19,4.56

In [103]:
bins = [0,10,15,20,25,30,35,40,200]
age_groups = ['Under 10', '10 - 14', '15 - 19', '20 - 24', '25 - 29', '30 - 34', '35 - 39', 'Over 40']

In [104]:
bins_df = purchase_data.copy()
bins_df["Age Groups"] = pd.cut(bins_df["Age"], bins, labels=age_groups)
group_bin = bins_df.groupby(["Age Groups"])

In [105]:
bin_count = group_bin["SN"].count()
total_count = purchase_data["SN"].count()
percentage = (bin_count / total_count) * 100
percentage

Age Groups
Under 10     4.102564
10 - 14      6.923077
15 - 19     25.641026
20 - 24     41.666667
25 - 29      9.871795
30 - 34      6.666667
35 - 39      4.230769
Over 40      0.897436
Name: SN, dtype: float64

In [106]:
age_percentage = pd.DataFrame({"Total Count": bin_count,
                         "Percentage of Players": percentage})
age_percentage["Percentage of Players"] = age_percentage["Percentage of Players"].map("{:.2f}%".format)
age_percentage.head(10)

            Total Count Percentage of Players
Age Groups
Under 10             32                 4.10%
10 - 14              54                 6.92%
15 - 19             200                25.64%
20 - 24             325                41.67%
25 - 29              77                 9.87%
30 - 34              52                 6.67%
35 - 39              33                 4.23%
Over 40               7                 0.90%

In [107]:
groupby_sn = purchase_data.groupby(["SN"])
groupby_count = groupby_sn["Item ID"].count()
groupby_total = groupby_sn["Price"].sum()
groupby_average = (groupby_total / groupby_count)

In [108]:
screen_name = pd.DataFrame({"Purchase Count": groupby_count,
                         "Average Purchase Price": groupby_average,
                         "Total Purchase Value": groupby_total})

In [109]:
screen_name = screen_name.sort_values("Total Purchase Value", ascending=False) 
screen_name["Average Purchase Price"] = screen_name["Average Purchase Price"].map("${:.2f}".format)
screen_name["Total Purchase Value"] = screen_name["Total Purchase Value"].map("${:.2f}".format)
screen_name = screen_name[["Purchase Count", "Average Purchase Price", "Total Purchase Value"]]
screen_name.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [110]:
top_spenders = screen_name.sort_values("Total Purchase Value", ascending=False)
top_spenders.head()

              Purchase Count Average Purchase Price Total Purchase Value
SN
Haillyrgue51               3                  $3.17                $9.50
Phistym51                  2                  $4.75                $9.50
Lamil79                    2                  $4.64                $9.29
Aina42                     3                  $3.07                $9.22
Saesrideu94                2                  $4.59                $9.18

In [111]:
purchased_items = purchase_data.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count")
average_price_items = purchase_data.groupby(["Item ID", "Item Name"]).mean()["Price"].rename("Average Purchase Price")
total_value = purchase_data.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase Value")

In [112]:
purchased_items = pd.DataFrame({"Purchase Count":purchased_items,
                                   "Item Price":average_price_items,
                                   "Total Purchase Value":total_value,})

purchased_items.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4        1.28                  5.12
1       Crucifer                         3        3.26                  9.78
2       Verdict                          6        2.48                 14.88
3       Phantomlight                     6        2.49                 14.94
4       Bloodlord's Fetish               5        1.70                  8.50

In [113]:
most_popular = purchased_items.sort_values("Purchase Count", ascending=False)
most_popular.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [114]:
most_profitable = purchased_items.sort_values("Total Purchase Value", ascending=False)
most_profitable.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80